<template>
	<div class="lf-span" :style="{width:htmlWidth + 'px'}">
		<div class="lf-mat"></div>
		<div>
			<h3 class="lf-center">会员用户服务条款</h3>
			<span>
				&emsp;以下是本公司/本店为您提供服务的条款。
				本协议详述您使用我们的服务所遵循的条款和
				条件。如您有任何疑问，请及时联系我们。我们
				希望您遵守以下的规定，加入会员之前请仔细阅读
				下列条款。一旦您注册成为本站会员，则表示
				您已阅读、理解、并同意本协议所包含的所有条
				款，敬请注意。
			</span>
			<h4>一、会员用户注册</h4>
			<h5>1.资料填写</h5>
			<span>
				1）提供准确、真实、有效的个人资料；如果会员
				提供的资料包含有不正确的信息，本公司/本店
				保留结束会员使用会员服务资格的权利。
				
				2）如个人资料有任何变动，必须及时通知本公
				司/本店修改会员个人信息。
				
				3）允许本公司/本店不定时向您的电子邮箱及手
				机号发送各种信息。
			</span>
			<h5>2.会员的账号，密码和安全性：</h5>
			<span>
				1) 会员帐号请用您的电子邮件地址或手机号登
				录。
				
				2) 会员将对会员名和密码安全以及用其会员名
				进行的所有活动和事件负全责。
				
				3) 会员若发现任何非法盗用会员帐号或存在安
				全漏洞的情况，须立即通知本公司/本店。
			</span>
			<h4>二、 有以下行为的会员将被取消会员资格</h4>
			<span>
				1) 违反注册条款。
				
				2) 提供虚假个人资料。
				
				3) 会员有损本公司/本店利益的行为。
				
				4) 违反中国的法律、法规、违反互联网相关规定
				的行为。
				
				5) 将会员帐号用于出售、拍卖等，拿会员帐号当
				作商品进行交易的行为。
				
				6) 出借、转让会员帐号给其他会员等不恰当行使
				会员权利的行为。
				
				7) 通过盗取密码、诈骗等不正当手段获得会员帐
				号的行为。
				
				8) 不遵守本公司/本店的会员政策。
			</span>
			<h4>三、会员隐私制度</h4>
			<span>
				&emsp;本公司/本店重视对会员隐私保护，尊重会员个
				人隐私是本公司/本店的一项基本政策。您提供
				的登记资料及本公司/本店保留的有关您的若干
				其他个人资料将受到中国有关隐私的法律保护。
				本公司/本店一定不会在未经您授权时公开、编
				辑或透露其注册资料及保存在本公司/本店的非
				公开内容，除非有法律要求或本公司/本店在诚
				信的基础上认为透露这些信件在以下四种情况是
				必要的：
				
				1)遵守有关法律规定，遵从本公司/本店合法服
				务程序。
				
				2)保持维护本公司/本店的商标所有权。
				
				3)在紧急情况下竭力维护用户个人和社会大众的
				隐私安全。
				
				4)符合其他相关的要求。
			</span>
			<h4>四、交易</h4>
			<span>
				&emsp;会员在进行物品购买或兑换时必须遵守以下
				条款：
				
				1) 订单、价格和付款
				
				&emsp;产品或服务价格、付款条件和配送在订单中
				以书面形式明确约定为准。
				
				2) 所有权和风险
				
				&emsp;产品所有权和风险在产品交付会员用户或其
				指定收货人时转移给会员用户。
				
				3) 商品质量
				
				&emsp;有国家标准或专业标准的，按国家标准或专
				业标准执行；无前述标准的，按生产厂的企业标
				准执行；无生产厂企业标准的，由会员用户与本
				公司/本店协商确定。如果物品质量不符合标准，
				会员可以要求换货或退货。
				
				4)本公司/本店有权在发现了产品及订单的明显
				错误的情况下，单方面撤回该信息或撤销订单。
				在下订单的同时，您应该对订单中提供的所有信
				息的真实性负责。
			</span>
			<h4>五、拒绝提供担保</h4>
			<span>
				&emsp;用户个人对会员服务的使用承担风险。本公
				司/本店对此不作任何类型的担保，不论是明确
				的或隐含的。本公司/本店对在本公司/本店上得
				到的任何商品服务或交易进程，不作担保。
			</span>
			<h4>六、权利和义务</h4>
			<span>
				1)会员有义务保管好会员账号等个人信息，因会
				员保管不善发生信息泄露造成的损失，概与本公
				司/本店无关，由会员自行承担。
				
				2)会员用户与本公司/本店一致同意，因信息泄
				露等造成会员用户或本公司、本店的任何直接、
				间接损失的，会员服务平台无需承担任何责任。
				造成会员服务平台的系统提供方损失的，应由会
				员用户和本公司、本店共同赔偿。
				
				3)会员用户与本公司/本店一致同意，会员与本
				公司/本店的交易等行为所产生的纠纷，与会员
				服务平台的系统提供方无关。造成会员服务平台
				的系统提供方损失的，应由会员用户和本公司/
				本店共同赔偿。
			</span>
			<h4>七、对会员信息的存储和限制</h4>
			<span>
				&emsp;本公司/本店不对会员所发布及保留信息的
				删除或储存失败负责。本公司/本店有判定会员
				的行为是否符合本公司/本店服务条款的要求和
				精神的权利，如果用户违背了服务条款的规定，
				本站有终止对其提供会员服务的权利。
			</span>
			<h4>八、会员管理</h4>
			<span>
				&emsp;会员单独承担发布内容的责任。会员对服务
				的使用适用于本公司/本店所在地的国家法律、
				地方法律和国际法律、条约等。会员必须遵循：
				
				1)从中国境内向外传输技术性资料时必须符合中
				国有关法规。
				
				2)使用会员服务不作非法用途。
				
				3)遵守所有使用会员服务的网络协议、规定、程
				序和惯例。
				
				&emsp;会员须承诺不传输任何非法的、骚扰性的、
				中伤他人的、辱骂性的、恐性的、伤害性的、庸俗
				的，淫秽等信息资料。另外，会员也不能传输如
				何教唆他人构成犯罪行为的资料；不能传输助长
				国内不利条件和涉及国家安全的资料；不能传输
				任何不符合当地法规、国家法律和国际法律的资
				料。未经许可而非法进入其它电脑系统是禁止的。
				
				&emsp;若会员的行为不符合以上提到的服务条款，
				本公司/本店将作出独立判断立即取消会员服务
				帐号。会员若在本公司/本店的服务平台上散布
				和传播反动、色情或其他违反国家法律的信息，
				本公司/本店的系统记录有可能作为用户违反法
				律的证据。
			</span>
			<h4>九、会员积分及兑换</h4>
			<span>
				1.会员在本公司/本店的有效购买行为将获得积
				分，可累积积分的购买行为包括但不限于：在本
				公司/本店的购买行为；在本公司/本店微信公众
				号、官方手机客户端等官方平台的购买行为。
				
				2.会员积分将根据交易金额自动计算，积分规则
				以本公司/本店的实际规定为准。
				
				3.如果因各种原因而导致购买未成功，如产生退
				货、取消订单等情形，本公司/本店将撤销会员账
				户里面因此次购买而相应赠送的积分。
				
				4.会员可根据积分兑换相应的积分礼品。积分礼
				品将不定期进行调整，请登录会员中心及时查
				询，本公司/本店不再另行通知。
				
				5.积分一经兑换礼品后，不可退还。
			</span>
			<h4>十、储值卡功能</h4>
			<span>
				1.会员可选择使用储值卡功能。
				
				2.会员按照本公司/本店的充值规则将一定金额
				的人民币充值到本公司/本店的会员账户下，会
				员在本公司/本店消费，即可直接使用会员账户
				内的金额进行支付。
				
				3.会员一经充值后，不能提现亦不能申请退还。
			</span>
			<h4>十一、卡券功能</h4>
			<span>
				1）会员可选择使用卡券功能。
				
				2）本公司/本店将通过微信或短信等方式将各类
				优惠券发送给会员，会员领取后，在本公司/本店
				消费时，可以核销优惠券直接用做减免金额。
				
				3）优惠券的种类包含满减券、代金券、折扣券
				等，具体按照本公司/本店的规定执行。
			</span>
			<h4>十二、免责声明</h4>
			<span>
				&emsp;本公司/本店有义务尽力避免服务中断或将
				中断时间限制在最短时间内，保证会员网上交易
				等活动的顺利进行。但以下情况，本公司/本店无
				需承担任何责任：
				
				1)由于您将会员密码告知他人或与他人共享注册
				账户，由此导致任何个人资料泄露。
				
				2)任何由于黑客攻击、计算机病毒侵入或发作、
				因政府管理而造成暂时性关闭等影响网络正常经
				营之不可抗力而造成服务平台崩溃或无法正常使
				用导致网上交易无法完成或丢失有关的信息、记
				录等，本公司/本店不承担责任；
				
				3)任何会员向本站提供错误、不完整、不实信息
				等造成不能正常使用服务或遭受任何其他损失，
				概与本公司/本店无关。
			</span>
			<h4>十三、法律管辖和适用</h4>
			<span>
				&emsp;本协议的订立、执行和解释及争议的解决均
				应适用中国法律。 如双方就本协议内容或其执行
				发生任何争议，双方应尽力友好协商解决；协商
				不成时，任何一方均可向本公司/本店所在地的
				人民法院提起诉讼。
			</span>
		</div>
		<div class="lf-mat"></div>
	</div>
</template>

<script>
	export default {
		data() {
			return{
				htmlProportion: '',		//屏幕长宽比例
				htmlWidth: '',		//屏幕宽
				htmlheight: '',		//屏幕高
				isWxPay: true,	
			}
		},
		created() {
			this.htmlWidth = document.documentElement.clientWidth || document.body.clientWidth;
			this.htmlheight = document.documentElement.clientHeight || document.body.clientHeight;
			this.htmlProportion = this.htmlWidth / 750 ;
			// console.log(this.htmlWidth);
			// console.log(this.htmlheight);
		},
		methods: {
			
		}
	}
</script>

<style>
	body{
		margin: 0;
	}
	.lf-span > div{
		padding: 0 0.625rem;
	}
	.lf-span span{
		margin: 1.25rem 10px;
		line-height: 0.625rem;
		letter-spacing: 1px;
		font-size: 0.75rem;
	}
	.lf-span h4,h5{
		margin: 50upx 0;
	}
	.lf-mat{
		/* width: 100%; */
		height: 0.625rem;
		background-color: #F1F1F3;
	}
	.lf-center{
		text-align: center;
	}
</style>
